console.log("# Часть 1 100/100\n\n" +
    "Страница Main (60)\n" +
    "Проверка верстки 7/7\n" +
    "\n" +
    "верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . 4/4\n" +
    "логотип в хедере состоит из текстовых элементов 1/1\n" +
    "страница содержит ровно один элемент <h1> 1/1\n" +
    "добавлен favicon 1/1\n" +
    "\n" +
    "Вёрстка соответствует макету 35/35\n" +
    "\n" +
    "блок <header> 5/5\n" +
    "блок Not only 5/5\n" +
    "блок About 5/5\n" +
    "блок Our Friends 5/5\n" +
    "блок Help 5/5\n" +
    "блок In addition 5/5\n" +
    "блок <footer> 5/5\n" +
    "\n" +
    "Требования к css 6/6\n" +
    "\n" +
    "для позиционирования элементов блока Help использована сеточная верстка (flexbox или grid) 2/2\n" +
    "при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине 2/2\n" +
    "фоновый цвет тянется на всю ширину страницы 2/2\n" +
    "\n" +
    "Интерактивность элементов 12/12\n" +
    "\n" +
    "элемент About the Shelter в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны 2/2\n" +
    "каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки 2/2\n" +
    "плавная прокрутка по якорям 2/2\n" +
    "выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Main +2\n" +
    "выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета 2/2\n" +
    "обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы 2/2\n" +
    "\n" +
    "Страница Pets (40)\n" +
    "Проверка верстки 7/7\n" +
    "\n" +
    "верстка страницы валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ . 4/4\n" +
    "логотип в хедере состоит из текстовых элементов 1/1\n" +
    "страница содержит ровно один элемент <h1> 1/1\n" +
    "добавлен favicon 1/1\n" +
    "\n" +
    "Вёрстка соответствует макету 15/15\n" +
    "\n" +
    "блок <header> 5/5\n" +
    "блок Our Friends 5/5\n" +
    "блок <footer> 5/5\n" +
    "\n" +
    "Требования к css 4/4\n" +
    "\n" +
    "при уменьшении масштаба страницы браузера или увеличении ширины страницы (>1280px) вёрстка размещается по центру, а не сдвигается в сторону и не растягивается по всей ширине 2/2\n" +
    "фоновый цвет тянется на всю ширину страницы 2/2\n" +
    "\n" +
    "Интерактивность элементов 14/14\n" +
    "\n" +
    "элемент Our pets в навигации подсвечен и неинтерактивен, остальные элементы навигации интерактивны 2/2\n" +
    "доступные кнопки пагинации (вправо) активны, недоступные (влево) - неактивны (disabled) 2/2\n" +
    "каждая карточка с питомцем в блоке Our Friends интерактивна при наведении на любую область этой карточки 2/2\n" +
    "плавная прокрутка по якорям 2/2\n" +
    "выполняются все ссылочные связи согласно Перечню ссылочных связей для страницы Pets 2/2\n" +
    "выполнена интерактивность ссылок и кнопок. Интерактивность заключается не только в изменении внешнего вида курсора, например, при помощи свойства cursor: pointer, но и в использовании и других визуальных эффектов, например, изменение цвета фона или цвета шрифта, согласно стайлгайду в макете. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета 2/2\n" +
    "обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике, не влияющее на соседние элементы 2/2\n\n"+
    "# Part 2 100/100:\n\n" +
    "Вёрстка страницы Main соответствует макету при ширине экрана 1280px 14/14\n" +
    "Вёрстка страницы Main соответствует макету при ширине экрана 768px 14/14\n" +
    "Вёрстка страницы Main соответствует макету при ширине экрана 320px 14/14\n" +
    "Вёрстка страницы Pets соответствует макету при ширине экрана 1280px 6/6\n" +
    "Вёрстка страницы Pets соответствует макету при ширине экрана 768px 6/6\n" +
    "Вёрстка страницы Pets соответствует макету при ширине экрана 320px 6/6\n" +
    "Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется 20/20\n" +
    "нет полосы прокрутки при ширине страницы Main от 1280рх до 768рх 5/5\n" +
    "нет полосы прокрутки при ширине страницы Main от 768рх до 320рх 5/5\n" +
    "нет полосы прокрутки при ширине страницы Pets от 1280рх до 768рх 5/5\n" +
    "нет полосы прокрутки при ширине страницы Pets от 768рх до 320рх 5/5\n" +
    "\n"+
    "Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции 8/8\n" +
    "на странице Main 4/4\n" +
    "на странице Pets 4/4\n\n" +
    "При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню 4/4\n" +
    "Верстка обеих страниц валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/  8/8"+

    "\n\n# Часть 3 110/110\n\n" +
    "Реализация burger menu на обеих страницах: 26/26\n\n" +
    "при ширине страницы меньше 768рх панель навигации скрывается, появляется бургер-иконка: 2/2\n" +
    "при нажатии на бургер-иконку, справа плавно появляется адаптивное меню шириной 320px, бургер-иконка плавно поворачивается на 90 градусов: 4/4\n" +
    "высота адаптивного меню занимает всю высоту экрана: 2/2\n" +
    "при повторном нажатии на бургер-иконку или на свободное от бургер-меню пространство адаптивное меню плавно скрывается уезжая за правую часть экрана, бургер-иконка плавно поворачивается на 90 градусов обратно: 4/4\n" +
    "бургер-иконка создана при помощи html+css, без использования изображений: 2/2\n" +
    "ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям, сохраняются заданные на первом этапе выполнения задания требования интерактивности элементов меню: 2/2\n" +
    "при клике по любой ссылке (интерактивной или неинтерактивной) в меню адаптивное меню плавно скрывается вправо, бургер-иконка поворачивается на 90 градусов обратно: 2/2\n" +
    "расположение и размеры элементов в бургер-меню соответствует макету (центрирование по вертикали и горизонтали элементов меню, расположение иконки). При этом на странице Pets цветовая схема может быть как темная, так и светлая: 2/2\n" +
    "область, свободная от бургер-меню, затемняется: 2/2\n" +
    "страница под бургер-меню не прокручивается: 4/4\n\n" +
    "\n\nРеализация слайдера-карусели на странице Main: 36/36\n\n" +
    "при нажатии на стрелки происходит переход к новому блоку элементов: 4/4\n" +
    "смена блоков происходит с соответствующей анимацией карусели (способ выполнения анимации не проверяется): 4/4\n" +
    "слайдер бесконечен, т.е. можно бесконечно много нажимать влево или вправо, и каждый раз будет прокрутка в эту сторону с новым набором карточек: 4/4\n" +
    "при переключении влево или вправо прокручивается ровно столько карточек, сколько показывается при текущей ширине экрана (3 для 1280px, 2 для 768px, 1 для 320px): 4/4\n" +
    "каждый новый слайд содержит псевдослучайный набор карточек животных, т.е. формируется из исходных объектов в случайном порядке со следующими условиями:\n" +
    "в текущем блоке слайда карточки с питомцами не повторяются: 4/4\n" +
    "в следующем блоке нет дублирования карточек с текущим блоком. Например в слайдере из 3 элементов, следующий выезжающий слайд будет содержать 3 (из 8 доступных) новых карточки питомца, таких, каких не было среди 3х карточек на предыдущем уехавшем слайде: 4/4\n" +
    "сохраняется только одно предыдущее состояние. Т.е. при последовательном переходе два раза влево, а потом два раза вправо, мы получим набор карточек, отличный от исходного: 4/4\n" +
    "при каждой перезагрузке страницы формируется новая последовательность карточек: 2/2\n" +
    "генерация наборов карточек происходит на основе 8 объектов с данными о животных: 2/2\n" +
    "при изменении ширины экрана (от 1280px до 320px и обратно), слайдер перестраивается и работает без перезагрузки страницы (набор карточек при этом может как изменяться, так и оставаться тем же, скрывая лишнюю или добавляя недостающую, и сохраняя при этом описанные для слайдера требования): 4/4\n" +
    "\n\nРеализация пагинации на странице Pets: 36/36\n\n" +
    "при перезагрузке страницы всегда открывается первая страница пагинации: 2/2\n" +
    "при нажатии кнопок > или < открывается следующая или предыдущая страница пагинации соответственно: 2/2\n" +
    "при нажатии кнопок >> или << открывается последняя или первая страница пагинации соответственно: 2/2\n" +
    "при открытии первой страницы кнопки << и < неактивны: 2/2\n" +
    "при открытии последней страницы кнопки > и >> неактивны: 2/2\n" +
    "в кружке по центру указан номер текущей страницы. При переключении страниц номер меняется на актуальный: 2/2\n" +
    "каждая страница пагинации содержит псевдослучайный набор питомцев, т.е. формируется из исходных объектов в случайном порядке со следующими условиями:\n" +
    "при загрузке страницы формируется массив из 48 объектов питомцев. Каждый из 8 питомцев должен встречаться ровно 6 раз: 4/4\n" +
    "при каждой перезагрузке страницы формируется новый массив со случайной последовательностью: 4/4\n" +
    "карточки питомцев не должны повторяться на одной странице: 4/4\n" +
    "при переключении страницы данные меняются (для >1280px меняется порядок карточек, для остальных - меняется набор и порядок карточек): 4/4\n" +
    "при неизменных размерах области пагинации, в том числе размерах окна браузера, и без перезагрузки страницы, возвращаясь на страницу под определенным номером, контент на ней всегда будет одинаков. Т.е. карточки питомцев будут в том же расположении, что и были до перехода на другие страницы: 2/2\n" +
    "общее количество страниц при ширине экрана 1280px - 6, при 768px - 8, при 320px - 16 страниц: 2/2\n" +
    "при изменении ширины экрана (от 1280px до 320px и обратно), пагинация перестраивается и работает без перезагрузки страницы (страница может оставаться той же или переключаться, при этом сформированный массив - общая последовательность карточек - не обновляется, сохраняются все остальные требования к пагинации): 4/4\n" +
    "\n\nРеализация попап на обеих страницах: 12/12\n\n" +
    "попап появляется при нажатии на любое место карточки с описанием конкретного животного: 2/2\n" +
    "часть страницы вне попапа затемняется: 2/2\n" +
    "при открытии попапа вертикальный скролл страницы становится неактивным, при закрытии - снова активным: 2/2\n" +
    "при нажатии на область вокруг попапа или на кнопку с крестиком попап закрывается, при этом при нажатии на сам попап ничего не происходит: 2/2\n" +
    "кнопка с крестиком интерактивная: 2/2\n" +
    "окно попапа (не считая кнопку с крестиком) центрировано по всем осям, размеры элементов попапа и их расположение совпадают с макетом: 2/2"
)